Revert "split antithesis-workload out of antithesis-bootstrap"
This reverts commit 79b451be62f78a7e931cec3a15f763aa58251d6b.
